evilpanda009/Microwave-Oven-Design-Assignment/Proteus 7 Professional/Proteus 7 Professional/SAMPLES/VSM for PICMICRO/Eval Boards/PICDEM LCD with PIC18F85J90/LCD2Demo_85J90_R0.C
Result = 0;

for (i=0; i<16; i++)
 {
   Result = Result << 1;
   if (Binary >= 32768) Result++;
   if (i < 15){ Result = AdjustBCD(Result);}
   Binary = Binary << 1;
 }

return Result ;
}
//**********************************************************************
unsigned short long AdjustBCD (unsigned short long R)
{
unsigned char R0,R1,R2;

BCD.S_Long = R;

if ((BCD.Nib.a + 3) > 7) BCD.Nib.a += 3;
if ((BCD.Nib.b + 3) > 7) BCD.Nib.b += 3;
if ((BCD.Nib.c + 3) > 7) BCD.Nib.c += 3;
if ((BCD.Nib.d + 3) > 7) BCD.Nib.d += 3;
if ((BCD.Nib.e + 3) > 7) BCD.Nib.e += 3;
if ((BCD.Nib.f + 3) > 7) BCD.Nib.f += 3;

R = BCD.S_Long;

return R;
}
//**********************************************************************
void LLine (unsigned int i)
{
  In.Int = i;
  S6Num (In.Nib.c);
  S7Num (In.Nib.b);
  S8Num (In.Nib.a);
}
//**********************************************************************
void ULine (unsigned short long i)
{
  BCD.S_Long = i;
  if (i < 0x10000) S1Num(No_Disp);
  else S1Num (BCD.Nib.e);
  if (i < 0x1000) S2Num(No_Disp);
  else S2Num (BCD.Nib.d);
  if (i < 0x100) S3Num(No_Disp);
  else S3Num (BCD.Nib.c);
  S4Num (BCD.Nib.b);
  S5Num (BCD.Nib.a);
}
//**********************************************************************
void TempIndic (unsigned char i)
{
  S5ON;
  if (i >= 5)
	{ S6ON; S7ON; S8ON;}
  else if (i >= 2)
	{ S6OFF; S7ON; S8ON;}
  else if (i >= 1)
	{ S6OFF; S7OFF; S8ON;}
}
//**********************************************************************
void BttryIndic (unsigned char i)
{
  S9ON;
  if (i >= 3)
	{ S10ON; S12ON; S11ON;}
  if (i == 2)
	{ S10OFF; S12ON; S11ON;}
  if (i == 1)
	{ S10OFF; S12OFF; S11ON;}
}


//**********************************************************************
void RTC_Display(void)
{
	BCD.S_Long = HEX2BIN (SEC);
	S6Num (BCD.Nib.b);
	S7Num (BCD.Nib.a);
	CirGraph(BCD.Nib.a);
	BCD.S_Long = HEX2BIN (MIN);
	S3Num (BCD.Nib.b);
	S4Num (BCD.Nib.a);
	BCD.S_Long = HEX2BIN (HR);
	S1Num (BCD.Nib.b);
	S2Num (BCD.Nib.a);
	COLON;
}
//**********************************************************************
void S1Num (unsigned char num)
{
	switch (num)
    {
		case 0: S1AON; S1BON; S1CON; S1DON; S1EON; S1FON; S1GOFF;break;
		case 1: S1AOFF;S1BON; S1CON; S1DOFF;S1EOFF;S1FOFF;S1GOFF;break;
		case 2: S1AON; S1BON; S1COFF;S1DON; S1EON; S1FOFF;S1GON; break;
		case 3: S1AON; S1BON; S1CON; S1DON;	S1EOFF;S1FOFF;S1GON; break;
		case 4: S1AOFF;S1BON; S1CON; S1DOFF;S1EOFF;S1FON; S1GON; break;
		case 5: S1AON; S1BOFF;S1CON; S1DON; S1EOFF;S1FON; S1GON; break;
		case 6: S1AON; S1BOFF;S1CON; S1DON; S1EON; S1FON; S1GON; break;
		case 7: S1AON; S1BON; S1CON; S1DOFF;S1EOFF;S1FOFF;S1GOFF;break;
		case 8: S1AON; S1BON; S1CON; S1DON; S1EON; S1FON; S1GON; break;
		case 9: S1AON; S1BON; S1CON; S1DON; S1EOFF;S1FON; S1GON; break;
		case A: S1AON; S1BON; S1CON; S1DOFF;S1EON; S1FON; S1GON; break;
		case C: S1AON; S1BOFF;S1COFF;S1DON; S1EON; S1FON; S1GOFF;break;
		case E: S1AON; S1BOFF;S1COFF;S1DON; S1EON; S1FON; S1GON; break;
		case F: S1AON; S1BOFF;S1COFF;S1DOFF;S1EON; S1FON; S1GON; break;
		case H: S1AOFF;S1BON; S1CON; S1DOFF;S1EON; S1FON; S1GON; break;
		case L: S1AOFF;S1BOFF;S1COFF;S1DON; S1EON; S1FON; S1GOFF;break;
		case P: S1AON; S1BON; S1COFF;S1DOFF;S1EON; S1FON; S1GON; break;

		case No_Disp: S1NumOFF;
    }
}
//**********************************************************************
void S2Num (unsigned char num)
{
	switch (num)
    {
		case 0: S2AON; S2BON; S2CON; S2DON; S2EON; S2FON; S2GOFF;break;
		case 1: S2AOFF;S2BON; S2CON; S2DOFF;S2EOFF;S2FOFF;S2GOFF;break;
		case 2: S2AON; S2BON; S2COFF;S2DON; S2EON; S2FOFF;S2GON; break;
		case 3: S2AON; S2BON; S2CON; S2DON;	S2EOFF;S2FOFF;S2GON; break;
		case 4: S2AOFF;S2BON; S2CON; S2DOFF;S2EOFF;S2FON; S2GON; break;
		case 5: S2AON; S2BOFF;S2CON; S2DON; S2EOFF;S2FON; S2GON; break;
		case 6: S2AON; S2BOFF;S2CON; S2DON; S2EON; S2FON; S2GON; break;
		case 7: S2AON; S2BON; S2CON; S2DOFF;S2EOFF;S2FOFF;S2GOFF;break;
		case 8: S2AON; S2BON; S2CON; S2DON; S2EON; S2FON; S2GON; break;
		case 9: S2AON; S2BON; S2CON; S2DON; S2EOFF;S2FON; S2GON; break;
		case A: S2AON; S2BON; S2CON; S2DOFF;S2EON; S2FON; S2GON; break;
		case C: S2AON; S2BOFF;S2COFF;S2DON; S2EON; S2FON; S2GOFF;break;
		case E: S2AON; S2BOFF;S2COFF;S2DON; S2EON; S2FON; S2GON; break;
		case F: S2AON; S2BOFF;S2COFF;S2DOFF;S2EON; S2FON; S2GON; break;
		case H: S2AOFF;S2BON; S2CON; S2DOFF;S2EON; S2FON; S2GON; break;
		case L: S2AOFF;S2BOFF;S2COFF;S2DON; S2EON; S2FON; S2GOFF;break;
		case P: S2AON; S2BON; S2COFF;S2DOFF;S2EON; S2FON; S2GON; break;

		case No_Disp: S2NumOFF;
    }
}
//**********************************************************************
void S3Num (unsigned char num)
{
	switch (num)
    {
		case 0: S3AON; S3BON; S3CON; S3DON; S3EON; S3FON; S3GOFF;break;
		case 1: S3AOFF;S3BON; S3CON; S3DOFF;S3EOFF;S3FOFF;S3GOFF;break;
		case 2: S3AON; S3BON; S3COFF;S3DON; S3EON; S3FOFF;S3GON; break;
		case 3: S3AON; S3BON; S3CON; S3DON;	S3EOFF;S3FOFF;S3GON; break;
		case 4: S3AOFF;S3BON; S3CON; S3DOFF;S3EOFF;S3FON; S3GON; break;
		case 5: S3AON; S3BOFF;S3CON; S3DON; S3EOFF;S3FON; S3GON; break;
		case 6: S3AON; S3BOFF;S3CON; S3DON; S3EON; S3FON; S3GON; break;
		case 7: S3AON; S3BON; S3CON; S3DOFF;S3EOFF;S3FOFF;S3GOFF;break;
		case 8: S3AON; S3BON; S3CON; S3DON; S3EON; S3FON; S3GON; break;
		case 9: S3AON; S3BON; S3CON; S3DON; S3EOFF;S3FON; S3GON; break;
		case A: S3AON; S3BON; S3CON; S3DOFF;S3EON; S3FON; S3GON; break;
		case C: S3AON; S3BOFF;S3COFF;S3DON; S3EON; S3FON; S3GOFF;break;
		case E: S3AON; S3BOFF;S3COFF;S3DON; S3EON; S3FON; S3GON; break;
		case F: S3AON; S3BOFF;S3COFF;S3DOFF;S3EON; S3FON; S3GON; break;
		case H: S3AOFF;S3BON; S3CON; S3DOFF;S3EON; S3FON; S3GON; break;
		case L: S3AOFF;S3BOFF;S3COFF;S3DON; S3EON; S3FON; S3GOFF;break;
		case P: S3AON; S3BON; S3COFF;S3DOFF;S3EON; S3FON; S3GON; break;

		case No_Disp: S3NumOFF;
    }
}
//**********************************************************************
void S4Num (unsigned char num)
{
	switch (num)
    {
		case 0: S4AON; S4BON; S4CON; S4DON; S4EON; S4FON; S4GOFF;break;
		case 1: S4AOFF;S4BON; S4CON; S4DOFF;S4EOFF;S4FOFF;S4GOFF;break;
		case 2: S4AON; S4BON; S4COFF;S4DON; S4EON; S4FOFF;S4GON; break;
		case 3: S4AON; S4BON; S4CON; S4DON;	S4EOFF;S4FOFF;S4GON; break;
		case 4: S4AOFF;S4BON; S4CON; S4DOFF;S4EOFF;S4FON; S4GON; break;
		case 5: S4AON; S4BOFF;S4CON; S4DON; S4EOFF;S4FON; S4GON; break;
		case 6: S4AON; S4BOFF;S4CON; S4DON; S4EON; S4FON; S4GON; break;
		case 7: S4AON; S4BON; S4CON; S4DOFF;S4EOFF;S4FOFF;S4GOFF;break;
		case 8: S4AON; S4BON; S4CON; S4DON; S4EON; S4FON; S4GON; break;
		case 9: S4AON; S4BON; S4CON; S4DON; S4EOFF;S4FON; S4GON; break;
		case A: S4AON; S4BON; S4CON; S4DOFF;S4EON; S4FON; S4GON; break;
		case C: S4AON; S4BOFF;S4COFF;S4DON; S4EON; S4FON; S4GOFF;break;
		case E: S4AON; S4BOFF;S4COFF;S4DON; S4EON; S4FON; S4GON; break;
		case F: S4AON; S4BOFF;S4COFF;S4DOFF;S4EON; S4FON; S4GON; break;
		case H: S4AOFF;S4BON; S4CON; S4DOFF;S4EON; S4FON; S4GON; break;
		case L: S4AOFF;S4BOFF;S4COFF;S4DON; S4EON; S4FON; S4GOFF;break;
		case P: S4AON; S4BON; S4COFF;S4DOFF;S4EON; S4FON; S4GON; break;

