evilpanda009/Microwave-Oven-Design-Assignment/Proteus 7 Professional/Proteus 7 Professional/SAMPLES/VSM for PICMICRO/Eval Boards/PICDEM LCD with PIC18F85J90/LCD2Demo_85J90_R0.C
		case No_Disp: S4NumOFF;
    }
}
//**********************************************************************
void S5Num (unsigned char num)
{
	switch (num)
    {
		case 0: S5AON; S5BON; S5CON; S5DON; S5EON; S5FON; S5GOFF;break;
		case 1: S5AOFF;S5BON; S5CON; S5DOFF;S5EOFF;S5FOFF;S5GOFF;break;
		case 2: S5AON; S5BON; S5COFF;S5DON; S5EON; S5FOFF;S5GON; break;
		case 3: S5AON; S5BON; S5CON; S5DON;	S5EOFF;S5FOFF;S5GON; break;
		case 4: S5AOFF;S5BON; S5CON; S5DOFF;S5EOFF;S5FON; S5GON; break;
		case 5: S5AON; S5BOFF;S5CON; S5DON; S5EOFF;S5FON; S5GON; break;
		case 6: S5AON; S5BOFF;S5CON; S5DON; S5EON; S5FON; S5GON; break;
		case 7: S5AON; S5BON; S5CON; S5DOFF;S5EOFF;S5FOFF;S5GOFF;break;
		case 8: S5AON; S5BON; S5CON; S5DON; S5EON; S5FON; S5GON; break;
		case 9: S5AON; S5BON; S5CON; S5DON; S5EOFF;S5FON; S5GON; break;
		case A: S5AON; S5BON; S5CON; S5DOFF;S5EON; S5FON; S5GON; break;
		case C: S5AON; S5BOFF;S5COFF;S5DON; S5EON; S5FON; S5GOFF;break;
		case E: S5AON; S5BOFF;S5COFF;S5DON; S5EON; S5FON; S5GON; break;
		case F: S5AON; S5BOFF;S5COFF;S5DOFF;S5EON; S5FON; S5GON; break;
		case H: S5AOFF;S5BON; S5CON; S5DOFF;S5EON; S5FON; S5GON; break;
		case L: S5AOFF;S5BOFF;S5COFF;S5DON; S5EON; S5FON; S5GOFF;break;
		case P: S5AON; S5BON; S5COFF;S5DOFF;S5EON; S5FON; S5GON; break;

		case No_Disp: S5NumOFF;
    }
}
//**********************************************************************
void S6Num (unsigned char num)
{
	switch (num)
    {
		case 0: S6AON; S6BON; S6CON; S6DON; S6EON; S6FON; S6GOFF;break;
		case 1: S6AOFF;S6BON; S6CON; S6DOFF;S6EOFF;S6FOFF;S6GOFF;break;
		case 2: S6AON; S6BON; S6COFF;S6DON; S6EON; S6FOFF;S6GON; break;
		case 3: S6AON; S6BON; S6CON; S6DON;	S6EOFF;S6FOFF;S6GON; break;
		case 4: S6AOFF;S6BON; S6CON; S6DOFF;S6EOFF;S6FON; S6GON; break;
		case 5: S6AON; S6BOFF;S6CON; S6DON; S6EOFF;S6FON; S6GON; break;
		case 6: S6AON; S6BOFF;S6CON; S6DON; S6EON; S6FON; S6GON; break;
		case 7: S6AON; S6BON; S6CON; S6DOFF;S6EOFF;S6FOFF;S6GOFF;break;
		case 8: S6AON; S6BON; S6CON; S6DON; S6EON; S6FON; S6GON; break;
		case 9: S6AON; S6BON; S6CON; S6DON; S6EOFF;S6FON; S6GON; break;
		case A: S6AON; S6BON; S6CON; S6DOFF;S6EON; S6FON; S6GON; break;
		case C: S6AON; S6BOFF;S6COFF;S6DON; S6EON; S6FON; S6GOFF;break;
		case E: S6AON; S6BOFF;S6COFF;S6DON; S6EON; S6FON; S6GON; break;
		case F: S6AON; S6BOFF;S6COFF;S6DOFF;S6EON; S6FON; S6GON; break;
		case H: S6AOFF;S6BON; S6CON; S6DOFF;S6EON; S6FON; S6GON; break;
		case L: S6AOFF;S6BOFF;S6COFF;S6DON; S6EON; S6FON; S6GOFF;break;
		case P: S6AON; S6BON; S6COFF;S6DOFF;S6EON; S6FON; S6GON; break;

		case No_Disp: S6NumOFF;
    }
}
//**********************************************************************
void S7Num (unsigned char num)
{
	switch (num)
    {
		case 0: S7AON; S7BON; S7CON; S7DON; S7EON; S7FON; S7GOFF;break;
		case 1: S7AOFF;S7BON; S7CON; S7DOFF;S7EOFF;S7FOFF;S7GOFF;break;
		case 2: S7AON; S7BON; S7COFF;S7DON; S7EON; S7FOFF;S7GON; break;
		case 3: S7AON; S7BON; S7CON; S7DON;	S7EOFF;S7FOFF;S7GON; break;
		case 4: S7AOFF;S7BON; S7CON; S7DOFF;S7EOFF;S7FON; S7GON; break;
		case 5: S7AON; S7BOFF;S7CON; S7DON; S7EOFF;S7FON; S7GON; break;
		case 6: S7AON; S7BOFF;S7CON; S7DON; S7EON; S7FON; S7GON; break;
		case 7: S7AON; S7BON; S7CON; S7DOFF;S7EOFF;S7FOFF;S7GOFF;break;
		case 8: S7AON; S7BON; S7CON; S7DON; S7EON; S7FON; S7GON; break;
		case 9: S7AON; S7BON; S7CON; S7DON; S7EOFF;S7FON; S7GON; break;
		case A: S7AON; S7BON; S7CON; S7DOFF;S7EON; S7FON; S7GON; break;
		case C: S7AON; S7BOFF;S7COFF;S7DON; S7EON; S7FON; S7GOFF;break;
		case E: S7AON; S7BOFF;S7COFF;S7DON; S7EON; S7FON; S7GON; break;
		case F: S7AON; S7BOFF;S7COFF;S7DOFF;S7EON; S7FON; S7GON; break;
		case H: S7AOFF;S7BON; S7CON; S7DOFF;S7EON; S7FON; S7GON; break;
		case L: S7AOFF;S7BOFF;S7COFF;S7DON; S7EON; S7FON; S7GOFF;break;
		case P: S7AON; S7BON; S7COFF;S7DOFF;S7EON; S7FON; S7GON; break;

		case No_Disp: S7NumOFF;
    }
}
//**********************************************************************
void S8Num (unsigned char num)
{
	switch (num)
    {
		case 0: S8AON; S8BON; S8CON; S8DON; S8EON; S8FON; S8GOFF;break;
		case 1: S8AOFF;S8BON; S8CON; S8DOFF;S8EOFF;S8FOFF;S8GOFF;break;
		case 2: S8AON; S8BON; S8COFF;S8DON; S8EON; S8FOFF;S8GON; break;
		case 3: S8AON; S8BON; S8CON; S8DON;	S8EOFF;S8FOFF;S8GON; break;
		case 4: S8AOFF;S8BON; S8CON; S8DOFF;S8EOFF;S8FON; S8GON; break;
		case 5: S8AON; S8BOFF;S8CON; S8DON; S8EOFF;S8FON; S8GON; break;
		case 6: S8AON; S8BOFF;S8CON; S8DON; S8EON; S8FON; S8GON; break;
		case 7: S8AON; S8BON; S8CON; S8DOFF;S8EOFF;S8FOFF;S8GOFF;break;
		case 8: S8AON; S8BON; S8CON; S8DON; S8EON; S8FON; S8GON; break;
		case 9: S8AON; S8BON; S8CON; S8DON; S8EOFF;S8FON; S8GON; break;
		case A: S8AON; S8BON; S8CON; S8DOFF;S8EON; S8FON; S8GON; break;
		case C: S8AON; S8BOFF;S8COFF;S8DON; S8EON; S8FON; S8GOFF;break;
		case E: S8AON; S8BOFF;S8COFF;S8DON; S8EON; S8FON; S8GON; break;
		case F: S8AON; S8BOFF;S8COFF;S8DOFF;S8EON; S8FON; S8GON; break;
		case H: S8AOFF;S8BON; S8CON; S8DOFF;S8EON; S8FON; S8GON; break;
		case L: S8AOFF;S8BOFF;S8COFF;S8DON; S8EON; S8FON; S8GOFF;break;
		case P: S8AON; S8BON; S8COFF;S8DOFF;S8EON; S8FON; S8GON; break;

		case No_Disp: S8NumOFF;
    }
}
//**********************************************************************
void BarGraph (unsigned char Count)
{
	if (BGCNT > Count)
	{
		switch (Count)
		{
			case 1: X2OFF;
			case 2: X3OFF;
			case 3: X4OFF;
			case 4: X5OFF;
			case 5: X6OFF;
			case 6: X7OFF;
			case 7: X8OFF;
			case 8: X9OFF;
			case 9: X10OFF;
			case 10: X11OFF;
			case 11: X12OFF;
			case 12: X13OFF;
			case 13: X14OFF;
			case 14: X15OFF;
			case 15: X16OFF;
			case 16: X17OFF;
			case 17: X18OFF;
			case 18: X19OFF;
			case 19: X20OFF;
		}
	}

if (BGCNT <= Count)
  {
	switch (Count)
	{
		case 20: X20ON;
		case 19: X19ON;
		case 18: X18ON;
		case 17: X17ON;
		case 16: X16ON;
		case 15: X15ON;
		case 14: X14ON;
		case 13: X13ON;
		case 12: X12ON;
		case 11: X11ON;
		case 10: X10ON;
		case  9: X9ON;
		case  8: X8ON;
		case  7: X7ON;
		case  6: X6ON;
		case  5: X5ON;
		case  4: X4ON;
		case  3: X3ON;
		case  2: X2ON;
		case  1: X1ON;
	 }
   }
BGCNT = Count;
}
//**********************************************************************
void CirGraph (unsigned char Count)
{
	CGOFF;
	switch (Count)
	{
		case 9: X28ON;
		case 8: X29ON;
		case 7: X30ON;
		case 6: X31ON;
		case 5: X32ON;
		case 4: X33ON;
		case 3: X34ON;
		case 2: X35ON;
		case 1: X36ON;
		case 0: X27ON;
	}

