evilpanda009/Microwave-Oven-Design-Assignment/Proteus 7 Professional/Proteus 7 Professional/SAMPLES/VSM for PICMICRO/Eval Boards/PICDEM LCD with PIC18F85J90/LCD2Demo_85J90_R0.C
}
//**********************************************************************
void LCD_CONFIG_CP (void)
{
    // Configure the LCD Regulator
	 LCDREGbits.BIAS2  = 1;
	 LCDREGbits.BIAS1  = 1;
	 LCDREGbits.BIAS0  = 1;
	 LCDREGbits.MODE13 = 1;
	 LCDREGbits.CKSEL1 = 1; //01 - TMR1 OSC, 10 - FRC 8 MHz
	 LCDREGbits.CKSEL0 = 1; //11 - INTRC 31 KHz; 00- No VLCAP
	 LCDREGbits.CPEN   = 1;

	// Select the frame clock prescaler using bits LP3:LP0
	 LCDPSbits.WFT     = 0;   //0 - TypeA
	 LCDPSbits.BIASMD  = 0;
	 LCDPSbits.LP3 = 0;
	 LCDPSbits.LP2 = 1;
	 LCDPSbits.LP1 = 0;
	 LCDPSbits.LP0 = 0;

	// Configure all LCD pins as inputs.
	// On Power on reset all pins are configured as inputs.

	// Configure the appropriate pins to function as segment drivers
	// using the LCDSEx registers
	// Always disable Seg 27, 28, 30 & 32 for this board for 85J90 devices.

	 LCDSE0 = 0xFF;
	 LCDSE1 = 0xFF;
	 LCDSE2 = 0xFF;
	 LCDSE3 = 0xA7; // Disable Seg30, Seg28 and Seg27
	 LCDSE4 = 0x00; // Disable unused segments
	 LCDSE5 = 0x70; // Disable unused segments

	// Configure the LCD module for the following using the LCDCON reg
	 LCDCONbits.CS1   = 1; // 00 Sys Clock, 01 TMR1 Clk
	 LCDCONbits.CS0   = 1; // 1x INTRC
	 LCDCONbits.LMUX1 = 1;
	 LCDCONbits.LMUX0 = 1;

	// Enable the LCD module by setting bit LCDEN
	 LCDCONbits.LCDEN = 1;

}
//**********************************************************************
void LCD_CONFIG_R (void)
{
    // Configure the LCD Regulator
	 LCDREGbits.BIAS2  = 1;
	 LCDREGbits.BIAS1  = 1;
	 LCDREGbits.BIAS0  = 1;
	 LCDREGbits.MODE13 = 1;
	 LCDREGbits.CKSEL1 = 0; //01 - TMR1 OSC, 10 - FRC 8 MHz
	 LCDREGbits.CKSEL0 = 0; //11 - INTRC 31 KHz; 00- No VLCAP
	 LCDREGbits.CPEN   = 0;

	// Select the frame clock prescaler using bits LP3:LP0
	 LCDPSbits.WFT     = 0;   //0 - TypeA
	 LCDPSbits.BIASMD  = 0;
	 LCDPSbits.LP3 = 0;
	 LCDPSbits.LP2 = 1;
	 LCDPSbits.LP1 = 0;
	 LCDPSbits.LP0 = 0;

	// Configure all LCD pins as inputs.
	// On Power on reset all pins are configured as inputs.

	// Configure the appropriate pins to function as segment drivers
	// using the LCDSEx registers
	// Always disable Seg 27, 28, 30 & 32 for this board for 85J90 devices.
	 LCDSE0 = 0xFF;
	 LCDSE1 = 0xFF;
	 LCDSE2 = 0xFF;
	 LCDSE3 = 0xA7; // Disable Seg30, Seg28 and Seg27
	 LCDSE4 = 0x00; // Disable unused segments
	 LCDSE5 = 0x70; // Disable unused segments

	// Configure the LCD module for the following using the LCDCON reg
	 LCDCONbits.CS1   = 1; // 00 Sys Clock, 01 TMR1 Clk
	 LCDCONbits.CS0   = 1; // 1x INTRC
	 LCDCONbits.LMUX1 = 1;
	 LCDCONbits.LMUX0 = 1;

	// Enable the LCD module by setting bit LCDEN
	 LCDCONbits.LCDEN = 1;

}
//**********************************************************************
void DisplayOn (void)
{
	S1ON; S2ON; S3ON; S4ON; S5ON; S6ON; S7ON; S8ON; S9ON; S10ON;
	S11ON; S12ON; S13ON; X26ON; X25ON; X24ON; X23ON; X22ON; X21ON;
	X20ON; X19ON; X18ON; X17ON; X16ON; X15ON; X14ON; X13ON;	X12ON;
	X11ON; X10ON; X9ON; X8ON; X7ON; X6ON; X5ON; X4ON; X3ON; X2ON;
	X1ON; F1ON; F2ON; F3ON; F4ON; X27ON; X28ON; X29ON; X30ON; X31ON;
	X32ON; X33ON; X34ON; X35ON; X36ON; S1AON; S1BON; S1CON; S1DON;
	S1EON; S1FON; S1GON; S2AON; S2BON; S2CON; S2DON; S2EON; S2FON;
	S2GON; COLON; S3AON; S3BON; S3CON; S3DON; S3EON; S3FON; S3GON;
	S4AON; S4BON; S4CON; S4DON; S4EON; S4FON; S4GON; DP1ON; S5AON;
	S5BON; S5CON; S5DON; S5EON; S5FON; S5GON; S6AON; S6BON; S6CON;
	S6DON; S6EON; S6FON; S6GON; S7AON; S7BON; S7CON; S7DON; S7EON;
	S7FON; S7GON; DP2ON; S8AON; S8BON; S8CON; S8DON; S8EON; S8FON;
	S8GON;

}
//**********************************************************************
void DisplayOff (void)
{
	S1OFF; S13OFF;
	S2OFF; S3OFF; S4OFF; S5OFF; S6OFF; S7OFF; S8OFF; S9OFF; S10OFF;
	S11OFF; S12OFF; X26OFF; X25OFF; X24OFF; X23OFF; X22OFF; X21OFF;
	X20OFF; X19OFF; X18OFF; X17OFF; X16OFF; X15OFF; X14OFF; X13OFF;
	X12OFF; X11OFF; X10OFF; X9OFF; X8OFF; X7OFF; X6OFF; X5OFF; X4OFF;
	X3OFF; X2OFF; X1OFF; F1OFF; F2OFF; F3OFF; F4OFF; X27OFF; X28OFF;
	X29OFF; X30OFF; X31OFF; X32OFF; X33OFF; X34OFF; X35OFF; X36OFF;
	S1AOFF;	S1BOFF;	S1COFF;	S1DOFF;	S1EOFF;	S1FOFF;	S1GOFF;	S2AOFF;
	S2BOFF;	S2COFF;	S2DOFF;	S2EOFF;	S2FOFF;	S2GOFF;	COLOFF;	S3AOFF;
	S3BOFF;	S3COFF;	S3DOFF;	S3EOFF;	S3FOFF;	S3GOFF;	S4AOFF;	S4BOFF;
	S4COFF;	S4DOFF;	S4EOFF;	S4FOFF;	S4GOFF;	DP1OFF;	S5AOFF;	S5BOFF;
	S5COFF;	S5DOFF;	S5EOFF;	S5FOFF;	S5GOFF;	S6AOFF;	S6BOFF;	S6COFF;
	S6DOFF;	S6EOFF;	S6FOFF;	S6GOFF;	S7AOFF;	S7BOFF;	S7COFF;	S7DOFF;
	S7EOFF;	S7FOFF;	S7GOFF;	DP2OFF;	S8AOFF;	S8BOFF;	S8COFF;	S8DOFF;
	S8EOFF;	S8FOFF;	S8GOFF;

}
//**********************************************************************

void Delay3 (void)
{
  unsigned int temp1, temp2;

 for (temp2=0;temp2<15000;temp2++);
}

void Delay_LP (void)
{
	TMR3H = 0xE8;
	TMR3L = 0xFF;
	T3CONbits.TMR3CS = 1; //Ext Timer1 Osc
	T3CONbits.T3SYNC = 1;
	T3CONbits.TMR3ON = 1;
	PIR2bits.TMR3IF = 0;
	PIE2bits.TMR3IE = 1;  //Enable Interrupt
	Sleep();
	PIE2bits.TMR3IE = 0;
	T3CONbits.TMR3ON = 0;
}

void Delay_LP1 (void)
{
	TMR3H = 0xE0;
	TMR3L = 0xFF;
	T3CONbits.TMR3CS = 1; //Ext Timer1 Osc
	T3CONbits.T3SYNC = 1;
	T3CONbits.TMR3ON = 1;
	PIR2bits.TMR3IF = 0;
	PIE2bits.TMR3IE = 1;  //Enable Interrupt
	Sleep();
	PIE2bits.TMR3IE = 0;
	T3CONbits.TMR3ON = 0;
}


